app/views/feed/index.html.erb

            <%= content_tag :div, class: "site_article_unread_count" do %>
                <%= simple_format site.articles.where(read: false).count.to_s %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."read" = ?  [["read", "f"]]

                <%= content_tag :div, class: "article_line_site_title" do %>
                    <%= simple_format Site.find(article.site_id).name %>
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 1]]