app/controllers/feed_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "sites".* FROM "sites" WHERE "sites"."user_id" = ?  [["user_id", 1]]
SELECT  1 AS one FROM "articles" WHERE "articles"."site_id" = ? AND "articles"."entry_id" = ? LIMIT 1  [["site_id", 1], ["entry_id", "tag:blogger.com,1999:blog-1044955426630875717.post-4251765898528750202"]]
SELECT "articles".* FROM "articles" WHERE "articles"."site_id" = ? AND "articles"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25)  [["site_id", 1]]
INSERT INTO "articles" ("title", "entry_id", "url", "feed_url", "published", "content", "site_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def index
        user = User.find(1)
        article_ids = []
        user.sites.each do |site|
            feed = Feed::GetFeed.new()
            rss = feed.get_feed(site.feed_url)
            rss.entries.each do |entry|
                if user.sites.articles.exists?(entry_id: entry.id.content)
                    next
                end
                user.sites.articles.build(
                    title: entry.title.content,
                    entry_id: entry.id.content,
                    url: entry.links[4].href,
                    feed_url: entry.links[2].href,
                    published: entry.published.content,
                    content: entry.content.content
                )
                user.sites.articles.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "sites" ("name", "url", "feed_url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def add
        url = params[:url]
        feed = Feed::GetFeed.new()
        rss = feed.get_feed(url)

        user = User.find(1)
        site = user.sites.build(name: rss.title.content, url: rss.links[2].href, feed_url: rss.links[0].href)
        site.save